#ifndef _PLATE_H_
#define _PLATE_H_

typedef struct {
    char name[4];
    char cityname[20];
    int  num;
}CITYNAME;

typedef struct {
    char color[4];
    int num;
}COLOR;

CITYNAME City[33] = { 
    {"京", "北京", 0}, 
    {"津", "天津", 1}, 
    {"沪", "上海", 2}, 
    {"渝", "重庆", 3}, 
    {"蒙", "内蒙古自治区", 4}, 
    {"新", "维吾尔自治区", 5}, 
    {"藏", "西藏自治区", 6}, 
    {"宁", "宁夏回族自治区", 7}, 
    {"桂", "广西壮族自治区", 8}, 
    {"港", "香港特别行政区", 9}, 
    {"澳", "澳门特别行政区", 10}, 
    {"黑", "黑龙江省", 11}, 
    {"吉", "吉林省", 12}, 
    {"辽", "辽宁省", 13}, 
    {"晋", "山西省", 14},
    {"冀", "河北省", 15}, 
    {"青", "青海省", 16}, 
    {"鲁", "山东省", 17}, 
    {"豫", "河南省", 18}, 
    {"苏", "江苏省", 19},
    {"皖", "安徽省", 20}, 
    {"浙", "浙江省", 21}, 
    {"闽", "福建省", 22}, 
    {"赣", "江西省", 23}, 
    {"湘", "湖南省", 24},
    {"鄂", "湖北省", 25}, 
    {"粤", "广东省", 26}, 
    {"琼", "海南省", 27}, 
    {"甘", "甘肃省", 28}, 
    {"陕", "山西省", 29},
    {"贵", "贵州省", 30}, 
    {"云", "云南省", 31}, 
    {"川", "四川省", 32},
};

COLOR Color[5] = { 
    {"蓝", 0}, 
    {"黄", 1}, 
    {"白", 2}, 
    {"黑", 3}, 
    {"绿", 4}, 
};

#endif
